RAN_1D/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4.5e-7;

boundaryField
{
    BOTTOM
    {
        type            fixedInternalValue;
    }

    INLET
    {
        type            cyclic;
    }

    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }   
    TOP 
    {
        type            fixedInternalValue; 
    } 
    OUTLET  
    {
        type            cyclic;
    }
}


// ************************************************************************* //
