RAN_1D/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6.75e-5;

boundaryField
{
    BOTTOM
    {
     type            fixedValue;
     value           uniform 1e-15;
    }

    INLET
    {
        type            cyclic;
    }

    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }   
    TOP 
    {
      type            fixedValue;
      value           uniform 1e-15;
    } 
    OUTLET  
    {
        type            cyclic;
    }
}


// ************************************************************************* //
