RAN_1D/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


RASModel RefEBRSMEterm1;       

turbulence      on;

printCoeffs     on;


RefEBRSMEterm1Coeffs
{
        //Turn on epsilon dirft term
    epsilonConsistency false;
	
    //Bounds for drift terms
    maxQk 1e8;
    minQk -1e8;
    maxQepsilon 1e8;
    minQepsilon -1e8;

    CmuKE           0.09;
    Clrr1           1.8;
    Clrr2           0.6;
    C1              1.44;
    C2              1.83;
    Cmu             0.07;
    sigmaEps        1.15;
    sigmaK          1.0;
    CL              0.133;
    CEta            80;
    yStarLim        5;
    implicitDiv     true;
    SSG             true;
    Cg1             3.4;
    Cg1s            1.8;
    Cg2             0;
    Cg3             0.8;
    Cg3s            1.3;
    Cg4             1.25;
    Cg5             0.4;
    CMu             0.21;
    CSEps           0.1826;
    CSR             0.21;
    SGDHEps         true;
    SGDHR           true;
    KolmogorovFlagStart 0;
    KolmogorovFlagEnd 0;
}

RefEBRSMCoeffs
{
    CmuKE           0.09;
    Clrr1           1.8;
    Clrr2           0.6;
    C1              1.44;
    C2              1.83;
    Cmu             0.07;
    sigmaEps        1.15;
    sigmaK          1.0;
    CL              0.133;
    CEta            80;
    yStarLim        5;
    implicitDiv     true;
    SSG             true;
    Cg1             3.4;
    Cg1s            1.8;
    Cg2             0;
    Cg3             0.8;
    Cg3s            1.3;
    Cg4             1.25;
    Cg5             0.4;
    crossTurbDiffusion true;
    CMu             0.21;
    CSEps           0.1826;
    CSR             0.21;
    SGDHEps         false;
    SGDHR           false; 
    A1p             0.065;
    KolmogorovFlagStart 0;
    KolmogorovFlagEnd 0;
}

// ************************************************************************* //
