RAN_1D/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/constant/interpToMesh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      interpToMesh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patchMap        (
/*		INLET INLET
		OUTLET OUTLET
		TOP TOP
		BOTTOM BOTTOM
		LEFT LEFT
		RIGHT RIGHT */ 
		); 

cuttingPatches  (); 


// ************************************************************************* //
