RAN_1D/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1200.71/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    TOP
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       17694;
    }
    BOTTOM
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       17775;
    }
    INLET
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          711;
        startFace       17856;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  OUTLET;
    }
    OUTLET
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          711;
        startFace       18567;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  INLET;
    }
    LEFT
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          711;
        startFace       19278;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  RIGHT;
    }
    RIGHT
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          711;
        startFace       19989;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  LEFT;
    }
)

// ************************************************************************* //
